오늘은 웹표준과 웹 접근성에 대해서 배워보았습니다. 웹표준은 어떤 환경에서도 이용할 수 있는 웹페이지를, 웹 접근성은 어떤 사람이든 이용 할 수 있는 웹페이지를 만들 수 있는 방법에 대한 내용이 담겨있습니다. 

# CH1. 웹 표준 개요 💁🏻

## **1. 웹 표준의 개념**

흔히들 웹은 인터넷이라고 생각합니다. 하지만 **인터넷은 ‘전 세계적으로 연결되어있는 컴퓨터 네트워크 통신망'**을 의미하며 웹을 포함해서 온라인 게임, 모바일 앱, 이메일 등 네트워크를 사용하는 다양한 서비스들을 모두 포함합니다. 

웹은 문서, 이미지, 영상 등 다양한 정보를 여러 사람들과 공유할 수 있는 공간입니다. 2000년대 초반에는 여러 브라우저 별로 작동되지 않는 등 **브라우저간의 호환성** 때문에 이슈가 있었습니다. 개발자들이 각 브라우저 별로 따로 개발해야하는 일이 생긴것이죠. 이러한 **웹 개발의 형식을 통일 시킨것이 웹표준**입니다. 

### 웹 표준

웹표준이란 W3C에서 권고하는 **‘웹에서 표준적으로 사용되는 기술이나 규칙'**으로 사용자가 어떠한 운영체제나 브라우저를 사용하더라도 모든 곳에서 페이지가 동일하게 보일 수 있게하는 제작기법을 담고있습니다. 

### 웹 표준의 장점

- 유지 보수의 용이성 → 코드가 경량화 되면서 트래픽 비용도 감소
- 웹 호환성 확보
- 검색 효율성 증대 → 웹표준에서는 적절한 HTML 요소의 사용, 웹페이지에 대한 정확한 정보 작성등 검색 효율성과 관련된 내용도 다루고있기때문에 검색 엔진에서 우선 순위로 노출될 수 있음
- 웹 접근성 향상

## 2**. Semantic HTML**

sementic이란 의미가 있는 이라는 영단어입니다. 즉, sementic HTML이란 HTML이 구조를 만드는 것을 넘어 의미를 갖도록 만들겠다는 의도가 담겨있다고 할 수있습니다. 

일반적으로 HTML로 구조를 짤때 div를 많이 사용합니다. 사용하기편하기 때문인것 같습니다. 하지만 너무 많은 div가 존재한다면 각각 어떤 내용이 들어갈지 명시할 수없습니다. 그래서 시멘틱한 HTML을 만들기 위해서는 <header>, <nav>, <main>, <aside>등의 시멘틱한 태그를 사용해서 각 사용의 목적을 명확히 할 수 있습니다. 

![스크린샷 2022-07-08 오전 11.33.08.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/39d6b557-6d0f-4db9-8570-c02bb42521f6/스크린샷_2022-07-08_오전_11.33.08.png)

### 시맨틱 HTML의 필요성

- 개발자간 소통 → div로 화면을 구성한다면 id나 class를 사용해서 일일이 요소의 이름을 표기해야합니다. 이러한 귀찮은 과정을 시맨틱한 요소를 사용하기만 해도 줄일 수 있습니다.
- 검색 효율성 → 앞서 말했듯이 검색엔진은 HTML코드를 보고 문서의 구조를 파악합니다. 시맨틱한 요소를 사용하면 중요한 내용이 어디에 들어있을지 우선 순위를 정할 수있습니다.
- 웹 접근성 → 시각 장애인의 경우 웹페이지에 접근할 때 음성으로 화면을 스크린리더를 이용하게 됩니다. 이때 시맨틱 요소로 구성되어있다면 화면의 구조에 대한 정보까지 추가적으로 전달해 줄 수있습니다.

## 3**. 하면 안되는 마크업**

- **인라인 요소에 블록 요소 넣기**
    
    → 인라인 요소인 <span>안에 , 블록 요소인 <div>가 들어있으면 안됩니다. 블록요소안에 인라인 요소를 꼭 넣도록 주의해야합니다. 
    
- `**<b><i>`요소 사용하기**
    
    → 똑같은 스타일을 부여하면서 콘텐츠에 의미를 부여하는 `<strong>`요소와 `<em>`요소를 사용하는 것이 좋습니다.
    
- `**<hgroup>` 마구잡이로 사용하기**
    
    ```jsx
    // 나쁜 예시
    <h1>엄청 큰 글씨</h1>
        <h3>적당히 큰 글씨</h3>
      <h2>큰 글씨</h2>
              <h6>엄청 작은 글씨</h6>
          <h4>그냥 글씨</h4>
    
    // 좋은 예시
    <h1>제목</h1>
      <h2>큰 목차</h2>
        <h3>작은 목차</h3>
        <h3>작은 목차</h3>
      <h2>큰 목차</h2>
        <h3>작은 목차</h3>
          <h4>더 작은 목차</h4>
          <h4>더 작은 목차</h4>
    ```
    
- ****`<br />` 연속으로 사용하기**
- ****인라인 스타일링 사용하기****
    
    → HTML과 CSS를 분리해서 작성해야합니다. HTML요소안에 인라인으로 스타일링 속성을 설정하는 것은 여러 오작동을 일으킬 수있습니다. 
    

## 4**. 크로스 브라우징**

크로스 브라우징이란 웹사이트에 접근하는 브라우저의 종류에 상관없이 **동등한** 화면과 기능을 제공할 수 있도록 만드는 작업을 의미합니다. 브라우저마다 사용하는 렌더링 엔진이 다르기 때문에 동일하게 만드는 것은 불가능합니다. 따라서 크로스 브라우징의 목표는 동등한 수준의 정보과 기능을 제공하는 것입니다. 

인터넷 익스플로러가 대표적인 예시입니다. 

### 크로스 브라우징 워크 플로우

1️⃣ **초기기획** 

- 어떤 웹사이트를 만들건지 정확하게 결정했다면 어떤 콘텐츠와 기능, 디자인등의 사항을 정해야합니다. 그 후 사이트의 고객이 누구일지 생각하며 고객이 사용하는 브라우저, 기기를 파악해서 여기에 맞는 기술을 사용해서 개발할 수 있도록 기획해야합니다.

2️⃣ **개발** 

- 코드를 작성할때 코드가 각 브라우저의 호환성이 어떤지 파악하고 사용해야합니다.

3️⃣ **테스트/ 발견**

- 안정적인 데스크톱 브라우저(롬, 엣지, 파이어폭스, 오페라, 사파리 등)에서 테스트를 진행합니다.
- 휴대폰 및 태플릿 브라우저(삼성 인터넷, 사파리, 안드로이드 기기의 크롬 등)에서 테스트를 진행합니다.
- 그 외에도 초기 기획 단계에서 목표했던 브라우저가 있다면 해당 브라우저에서 테스트를 진행합니다.
- Window, Linux, Mac 등 다양한 운영 체제에서도 테스트를 진행합니다.
- 혹은 자동으로 테스트를 진행해주는 도구를 이용 (TestComplete, LambdaTest, BitBar 등의 크로스 브라우징 테스트 툴)

4️⃣ **테스트/ 발견**

- 버그가 발생하는 위치를 최대한 좁혀서 특정하고 조건문을 작성해 다른 코드를 실행하게 하는 방식으로 고쳐나가는게 좋습니다.

# CH2. SEO 💁🏻

SEO는 검색엔진의 작동방식에 맞게 웹페이지를 최적화 해주는 작업입니다. 크게 On-Page SEO와 Off-Page SEO 두 가지로 나뉘어집니다.

- **On-Page SEO** : 페이지 내부에서 진행할 수 있는 SEO로 제목과 콘텐츠, 핵심 키워드의 배치, 효율적인 HTML 요소 사용법 등을 이용하는 방법
- **Off-Page SEO** : 웹 사이트 외부에서 이루어지는 SEO로, 소셜 미디어 홍보, 백링크(타 사이트에서 연결되는 링크) 등을 이용하는 방법으로, 웹 페이지 내용이나 구조와는 관계가 없음

## 2**. SEO에 영향을 미치는 요소들**

on-page에서 통제할 수있는 <meta>와 <title>요소들에 대해서 살펴보았습니다 

1️⃣  **<title> 요소**

![스크린샷 2022-07-08 오후 1.34.57.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/3b5d7c86-4b73-4d2e-aecf-541c037fd692/스크린샷_2022-07-08_오후_1.34.57.png)

- 검색 결과창에서 제목에 해당하는 요소, <head> 요소의 자식요소로 작성 할 수 있습니다.
- 핵심키워드를 포함하고 적절한 길이로 사이트 유입을 늘릴 수 있습니다.

2️⃣ **<meta> 요소**

![스크린샷 2022-07-08 오후 1.36.43.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/2fced3ff-4227-4dd4-8275-3e9928015459/스크린샷_2022-07-08_오후_1.36.43.png)

- 메타 데이터를 담는 요소, 해당 웹사이트에서 다루고 있는 데이터가 무엇인지 설명하는 요소입니다. → 이는 **SEO를 위해서 사용하는것이 목적**입니다.
    
    ![스크린샷 2022-07-08 오후 1.38.44.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/7d18dede-8463-477e-86c2-3a62fdf2e16a/스크린샷_2022-07-08_오후_1.38.44.png)
    
- 위와 같이 카카오톡으로 링크를 공유했을 때 뜨는 링크 미리보기와 관련정보도 여기에 들어있습니다. → 이 경우는 property속성을 사용하며, 다른 사람에게 공유하기 위한것이 목적입니다. 이를 **오픈그래프(Open Graph)**라고 합니다.

3️⃣ **<hgroup> 요소**

- 콘텐츠의 제목을 표시하는 용도인 만큰 핵심 키워드를 포함하고 있을 가능성이 높기때문에 검색엔진에서 중요하게 취급합니다.
- 똑같은 키워드를 쓰지않고 비슷한 키워드 혹은 핵심키워드와 관련된 키워드들을 포함시키는것이 좋습니다.

4️⃣ 콘텐츠

- 개성있는 브랜딩
- 복사 + 붙여넣기 금지
- 간결한 제목과 설명글
- 최대한 글자로 작성하기 → 이미지를 넣어야한다면 alt속성으로 이미지에 대한 설명을 꼭 써줘야합니다 .
